{"config": [{"config": {"padding": "valid", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_15", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 32, "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_12", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_15"}, "class_name": "Dropout"}, {"config": {"padding": "valid", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_16", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_13", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_16"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_8"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "name": "dense_19", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "units": 128, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "name": "dense_20", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "units": 128, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "name": "dense_21", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "units": 10, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}